load-testing/artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 1
      maxVusers: 50
      name: Warm up
    # - duration: 120
    #   arrivalRate: 3
    #   rampTo: 20
    #   name: Ramp up load
    # - duration: 240
    #   arrivalRate: 20
    #   name: Sustained load
  processor: './lib/processor.js'
  environments:
    alfajores:
      target: 'https://weu.komenci.alfajores.celo-testnet.org/v1'
      # target: 'https://eus.komenci.alfajores.celo-testnet.org/v1'
    baklava:
      target: 'http://localhost:3000'
    mainnet:
      target: 'http://localhost:3000'
scenarios:
  # - name: 'Komenci load test'
  - flow:
      - loop:
          # - log: 'Sent a request to the {{ $loopElement }}'
          # - get:
          #     url: '/health'
          #     headers: {content-type: application/json}
              # beforeRequest: "setUpEnvironment"
          - post: 
              url: '/startSession'
              headers: {content-type: application/json}
              beforeRequest: "setStartSessionBody"
              # afterResponse: "logHeaders"
              capture:
                json: "$.token"
                as: "token"
          # - log: "Start Session executed. Generated token {{ token }}"
          - log: "External account: {{ account }}"
          - get: 
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/checkSession'
              # afterResponse: "logHeaders"
          # - log: "Session checked"
          - post:
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/deployWallet'
              beforeRequest: "setDeployWalletBody"
              afterResponse: "waitTx"
          #     capture:
          #       json: "$.walletAddress"
          #       as: "walletAddress" 
          # - log: "Wallet deployed as {{ walletAddress }}"
          - post: 
              url: '/distributedBlindedPepper'
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              beforeRequest: "setDistributedBlindedPeppertBody"
              # capture:
              #   json: "$.identifier"
              #   as: "identifier" 
              afterResponse: "afterDistributedBlindedPepper"
          - log: "Get identifier."
          - get: 
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/checkSession'
              # afterResponse: "logHeaders"
              # Set account
          - post: 
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/submitMetaTransaction'
              beforeRequest: "setSubmitMetatransactionBody"
              afterResponse: "waitReceipt"
              capture:
                json: "$.txHash"
                as: "txHash" 
              strict: false
          - log: "Submitting MetaTransaction {{ txHash }}"
          - post: 
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/requestSubsidisedAttestations'
              beforeRequest: "setRequestSubsidisedAttestationsBody"
              afterResponse: "waitEvents"
          - log: "Request Subsidised Attestations"
          # select issuer
          - post: 
              headers: {"Content-type": "application/json", "Authorization": "Bearer {{ token }}"}
              url: '/submitMetaTransaction'
              beforeRequest: "selectIssuer"
              afterResponse: "getActionableAttestations"
          - log: "Issuer selected"
        count: 1